In [2]:
import pandas as pd

In [4]:
sub=["Dsa","Python","DBMS"]
marks=[33,21,23]
pd.Series(marks,sub)

Dsa       33
Python    21
DBMS      23
dtype: int64

In [6]:
marks=pd.Series([33,21,23],index=["Dsa","Python","DBMS"])

In [7]:
marks

Dsa       33
Python    21
DBMS      23
dtype: int64

In [8]:
d={"name":"Ziyaan","Course":"BCA","Address":"Baroda"}

In [9]:
Student=pd.Series(d)

In [11]:
Student

name       Ziyaan
Course        BCA
Address    Baroda
dtype: object

In [12]:
Student.values

array(['Ziyaan', 'BCA', 'Baroda'], dtype=object)

In [13]:
Student.keys()

Index(['name', 'Course', 'Address'], dtype='object')

In [16]:
import numpy as np

In [24]:
df=pd.DataFrame(np.random.randint(1,100,(4,3)),index=["ZIyaan","vvk","matin","frdin"],columns=["Dsa","Python","java"])

In [25]:
df

        Dsa  Python  java
ZIyaan   68      98    78
vvk      80      25    50
matin    26      31    12
frdin    93      67    86

In [30]:
df[["Dsa","java"]]

        Dsa  java
ZIyaan   68    78
vvk      80    50
matin    26    12
frdin    93    86

In [47]:
df["Total"]=df["Dsa"]+df["Python"]+df["java"]

In [48]:
df

        Dsa  Python  java  Total
ZIyaan   68      98    78    244
vvk      80      25    50    155
matin    26      31    12     69
frdin    93      67    86    246

In [67]:
df["Percentage"]=df["Total"]/300*100

In [69]:
df

        Dsa  Python  java  Total  Percentage
ZIyaan   68      98    78    244   81.333333
vvk      80      25    50    155   51.666667
matin    26      31    12     69   23.000000
frdin    93      67    86    246   82.000000

In [90]:
df.loc["ZIyaan"]

Dsa            68.000000
Python         98.000000
java           78.000000
Total         244.000000
Percentage     81.333333
Name: ZIyaan, dtype: float64

In [92]:
df.loc[["ZIyaan","vvk"]]

        Dsa  Python  java  Total  Percentage
ZIyaan   68      98    78    244   81.333333
vvk      80      25    50    155   51.666667

In [93]:
df.head(3)

        Dsa  Python  java  Total  Percentage
ZIyaan   68      98    78    244   81.333333
vvk      80      25    50    155   51.666667
matin    26      31    12     69   23.000000

In [94]:
df.head(1)

        Dsa  Python  java  Total  Percentage
ZIyaan   68      98    78    244   81.333333

In [97]:
df.loc["ZIyaan":"vvk"]

        Dsa  Python  java  Total  Percentage
ZIyaan   68      98    78    244   81.333333
vvk      80      25    50    155   51.666667

In [98]:
df.iloc[2]

Dsa           26.0
Python        31.0
java          12.0
Total         69.0
Percentage    23.0
Name: matin, dtype: float64

In [103]:
df.drop("Total",axis=1,inplace=True)

In [104]:
df

        Dsa  Python  java  Percentage
ZIyaan   68      98    78   81.333333
vvk      80      25    50   51.666667
matin    26      31    12   23.000000
frdin    93      67    86   82.000000

In [255]:
import pandas as pd

In [264]:
productName=["hoodie","tshirt","highneck","shirt","joggers"]
productId=[1,2,3,4,5]
productPrice=[100,200,300,400,500]

In [273]:
VVK=pd.DataFrame(data = [productId,productName,productPrice], index= ["productId","productName","productPrice"])

In [282]:
VVK.transpose()

  productId productName productPrice
0         1      hoodie          100
1         2      tshirt          200
2         3    highneck          300
3         4       shirt          400
4         5     joggers          500

In [371]:
VVK["productName":"productName"]

                  0       1         2      3        4
productName  hoodie  tshirt  highneck  shirt  joggers

In [374]:
VVK["productId":"productId"]

           0  1  2  3  4
productId  1  2  3  4  5

In [376]:
VVK["productPrice":]

                0    1    2    3    4
productPrice  100  200  300  400  500

In [383]:
VVK.loc["productName"]

0      hoodie
1      tshirt
2    highneck
3       shirt
4     joggers
Name: productName, dtype: object

In [384]:
VVK.loc["productId"]

0    1
1    2
2    3
3    4
4    5
Name: productId, dtype: object

In [386]:
for row in VVK.iterrows():
    print(row)

('productId', 0    1
1    2
2    3
3    4
4    5
Name: productId, dtype: object)
('productName', 0      hoodie
1      tshirt
2    highneck
3       shirt
4     joggers
Name: productName, dtype: object)
('productPrice', 0    100
1    200
2    300
3    400
4    500
Name: productPrice, dtype: object)

In [437]:
VVK.iloc[1:3
        
        
         ]

                   0       1         2      3        4
productName   hoodie  tshirt  highneck  shirt  joggers
productPrice     100     200       300    400      500

In [438]:
VVK.iloc[1:4,1]

productName     tshirt
productPrice       200
Name: 1, dtype: object

In [439]:
VVK.iloc[1:2,2]

productName    highneck
Name: 2, dtype: object

In [440]:
sub=["Dsa","Python","DBMS"]
marks=[33,21,23]
pd.Series(marks,sub)

Dsa       33
Python    21
DBMS      23
dtype: int64

In [ ]:
[]